# AddIntersectionElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..AddIntersectionElement Method
DividedSurface Class See Also
---
Adds an intersection element to the divided surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void AddIntersectionElement(
	ElementId newIntersectionElemId
)
```

Visual Basic
---
```text
Public Sub AddIntersectionElement ( _
	newIntersectionElemId As ElementId _
)
```

Visual C++
---
```text
public:
void AddIntersectionElement(
	ElementId^ newIntersectionElemId
)
```

# ### Parameters
newIntersectionElemId
    Type: Autodesk.Revit.DB..::..ElementId The intersection element to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The element newIntersectionElemId is not a level, grid, reference plane, or a curve element whose category is lines and reference lines. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace